# Винни-Пух попросил Вас посмотреть, есть ли в его стихах ритм. 
# Поскольку разобраться в его кричалках не настолько просто, 
# насколько легко он их придумывает, Вам стоит написать программу. 
# Винни-Пух считает, что ритм есть, если число слогов 
# (т.е. число гласных букв) в каждой фразе стихотворения одинаковое. 
# Фраза может состоять из одного слова, если во фразе несколько слов, 
# то они разделяются дефисами. Фразы отделяются друг от друга пробелами. 
# Стихотворение  Винни-Пух вбивает в программу с клавиатуры. В ответе 
# напишите “Парам пам-пам”, если с ритмом все в порядке и “Пам парам”, 
# если с ритмом все не в порядке

def count_vowels(word):
    vowels = "АЕИОУЫЭЮЯаеиоуыэюяAEIOUYaeiouy"
    return sum(1 for char in word if char in vowels)

def check_rhythm(poem):
    lines = poem.strip().split()
    syllable_counts = [count_vowels(line.replace('-', '')) for line in lines]
    
    if all(count == syllable_counts[0] for count in syllable_counts):
        return "Парам пам-пам"
    else:
        return "Пам парам"

# Ввод стихотворения Винни-Пуха
poem = input("Введите стихотворение Винни-Пуха: ")

# Проверка ритма
result = check_rhythm(poem)
print(result) 