# Даны два неупорядоченных набора целых чисел (может быть, с повторениями). Выдать без повторений в порядке возрастания все те числа, которые встречаются в обоих наборах.
# Пользователь вводит 2 числа. n — кол-во элементов первого множества. m — кол-во элементов второго множества. Затем пользователь вводит сами элементы множеств.

print("Привет! Давай найдем числа, которые встречаются в обоих наборах.")

# Пользователь вводит количество элементов первого и второго множества
n = int(input("Введите количество элементов первого множества: "))
m = int(input("Введите количество элементов второго множества: "))

# Создаем списки для хранения элементов первого и второго множества
set1 = []
set2 = []

# Пользователь вводит элементы первого множества
print("Введите элементы первого множества:")
for i in range(n):
    element = int(input())
    set1.append(element)

# Пользователь вводит элементы второго множества
print("Введите элементы второго множества:")
for i in range(m):
    element = int(input())
    set2.append(element)

# Находим пересечение множеств (числа, которые встречаются и в первом, и во втором множестве)
intersection = list(set(set1) & set(set2))

# Сортируем результат в порядке возрастания
intersection.sort()

# Выводим результат
print("Числа, которые встречаются в обоих наборах и в порядке возрастания:")
print(intersection)